{
  "vision_r": 8, 
  "att_bandwidth": 8, 
  "retention": 8, 
  "curr_time": null, 
  "curr_tile": null, 
  "name": "John Lin", 
  "first_name": "John", 
  "last_name": "Lin", 
  "big_five_personality_traits": "Low in Extraversion, Low in Agreeableness, Low in Conscientiousness, High in Openness to Experience, High in Neuroticism",
  "daily_plan_req": "1) Wake up late and enjoy a slow morning with coffee. 2) Spend the afternoon rearranging furniture or redecorating a room. 3) Watch an experimental film before bed.",
  "age": 42,
  "background": "Former art history professor turned freelance interior designer, passionate about unconventional home aesthetics.",
  "current_interests": "John Lin enjoys 1) Collecting vintage furniture and refurbishing it. 2) Trying out abstract painting techniques at home. 3) Listening to philosophical podcasts while reorganizing her bookshelves.",
  "lifestyle": "John Lin typically 1) Sleeps in and starts the day with strong black coffee. 2) Works on home decor projects in the afternoon. 3) Spends evenings journaling and contemplating new creative ideas.",
  "long_term_goals": "Transforming her home into a fully immersive art space while developing a personal philosophy of interior aesthetics that blends nostalgia with modern eccentricity.",
  "living_area": "the Ville:Lin family's house:Mei and John Lin's bedroom",
  "concept_forget": 100,
  "daily_reflection_time": 180,
  "daily_reflection_size": 5,
  "overlap_reflect_th": 4,
  "kw_strg_event_reflect_th": 10, 
  "kw_strg_thought_reflect_th": 9, 

  "recency_w": 1,
  "relevance_w": 1,
  "importance_w": 1,
  "recency_decay": 0.995,
  "importance_trigger_max": 250,
  "importance_trigger_curr": 250,
  "importance_ele_n": 0, 
  "thought_count": 5, 

  "daily_req": [], 
  "f_daily_schedule": [],
  "f_daily_schedule_hourly_org": [],
  "act_address": null, 
  "act_start_time": null, 
  "act_duration": null, 
  "act_description": null, 
  "act_pronunciatio": null, 
  "act_event": ["John Lin", null, null], 
  "act_obj_description": null, 
  "act_obj_pronunciatio": null, 
  "act_obj_event": [null, null, null], 
  "chatting_with": null, 
  "chat": null,
  "chatting_with_buffer": {}, 
  "chatting_end_time": null,
  "act_path_set": false, 
  "planned_path": [],
  "suggestion": null,
  "user_action_for_suggestion": null,
  "suggestion_eval_result": null,

  "criteria": {
    "Personal_Preference": "I prefer recommendations that align with my approach to handling activities and suit my current context. Specifically, I like to receive recommendations for vintage furniture shops or refurbishing techniques when I'm working on home decor projects in the afternoon, and philosophical podcast suggestions when I'm reorganizing my bookshelves. I also appreciate abstract painting technique recommendations when I'm in the mood to experiment with art at home.",
    "Timing": "I prefer to receive recommendations in the late morning, after I've had my coffee and am ready to start my day, so they don't interfere with my slow morning routine. Additionally, receiving recommendations in the early afternoon is ideal, as it aligns with my creative work schedule and doesn't disrupt my evening journaling and contemplation time.",
    "Frequency": "I prefer receiving recommendations once every 4 hours, in a way that avoids excessive interruptions and supports my focus on creative projects. Ideally, there should be a good balance between recommendation intervals and quiet periods, allowing me to immerse myself in my work without constant distractions.",
    "Communication_&_Safety": "I prefer recommendations to be communicated in a casual and thoughtful style that feels accessible and matches my communication preferences. It's also important that they respect my personal ethics and safety boundaries, ensuring that the content aligns with my values and interests."
  }
}