{
  "vision_r": 8, 
  "att_bandwidth": 8, 
  "retention": 8, 
  "curr_time": null, 
  "curr_tile": null, 
  "name": "John Lin", 
  "first_name": "John", 
  "last_name": "Lin", 
  "big_five_personality_traits": "Low in Extraversion, High in Agreeableness, High in Conscientiousness, Low in Openness to Experience, Low in Neuroticism",
  "daily_plan_req": "1) Water indoor plants and check soil moisture in the morning. 2) Organize a section of the bookshelf or storage space in the afternoon. 3) Watch an old classic movie before bed for relaxation.",
  "age": 62,
  "background": "Retired school teacher, passionate about home organization and gardening.",
  "current_interests": "John Lin enjoys 1) Knitting and crocheting handmade gifts. 2) Baking simple comfort food recipes. 3) Listening to classical music while reading historical fiction.",
  "lifestyle": "John Lin typically 1) Wakes up at 6am and enjoys a quiet breakfast. 2) Takes a short afternoon nap around 2pm. 3) Ends the day with herbal tea and a puzzle before bedtime at 9:30pm.",
  "long_term_goals": "Maintaining a peaceful and structured home environment while staying connected with loved ones and fostering a sense of calm through simple daily routines.",
  "living_area": "the Ville:Lin family's house:Mei and John Lin's bedroom",
  "concept_forget": 100,
  "daily_reflection_time": 180,
  "daily_reflection_size": 5,
  "overlap_reflect_th": 4,
  "kw_strg_event_reflect_th": 10, 
  "kw_strg_thought_reflect_th": 9, 

  "recency_w": 1,
  "relevance_w": 1,
  "importance_w": 1,
  "recency_decay": 0.995,
  "importance_trigger_max": 250,
  "importance_trigger_curr": 250,
  "importance_ele_n": 0, 
  "thought_count": 5, 

  "daily_req": [], 
  "f_daily_schedule": [],
  "f_daily_schedule_hourly_org": [],
  "act_address": null, 
  "act_start_time": null, 
  "act_duration": null, 
  "act_description": null, 
  "act_pronunciatio": null, 
  "act_event": ["John Lin", null, null], 
  "act_obj_description": null, 
  "act_obj_pronunciatio": null, 
  "act_obj_event": [null, null, null], 
  "chatting_with": null, 
  "chat": null,
  "chatting_with_buffer": {}, 
  "chatting_end_time": null,
  "act_path_set": false, 
  "planned_path": [],
  "suggestion": null,
  "user_action_for_suggestion": null,
  "suggestion_eval_result": null,

  "criteria": {
    "Personal_Preference": "I prefer recommendations that align with my approach to handling activities and suit my current context. Specifically, I like to receive gardening tips when I'm tending to my indoor plants in the morning, and organizational advice when I'm arranging my bookshelf or storage space in the afternoon. I appreciate movie recommendations for classic films when I'm winding down before bed.",
    "Timing": "I prefer to receive recommendations in the morning when I'm having my quiet breakfast, so they don't interfere with my afternoon nap or evening relaxation routine. Also, I prefer to receive recommendations before going to bed. Receiving suggestions during these times allows me to incorporate them into my day without disrupting my established schedule.",
    "Frequency": "I prefer receiving recommendations once every morning and once before going to bed, in a way that avoids excessive interruptions and supports my focus or productivity. Ideally, there should be a good balance between recommendation intervals and quiet periods, allowing me to enjoy my activities without feeling overwhelmed.",
    "Communication_&_Safety": "I prefer recommendations to be communicated in a polite and gentle style that feels accessible and matches my communication preferences. It's also important that they respect my personal ethics and safety boundaries, ensuring that the suggestions are considerate of my lifestyle and values."
  }
}